Revit 2026 API
FilteredElementCollector.GetElementIdIterator Method
 Returns an element id iterator to the elements passing the filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public FilteredElementIdIterator GetElementIdIterator()
Public Function GetElementIdIterator As FilteredElementIdIterator
public:
FilteredElementIdIterator^ GetElementIdIterator()
member GetElementIdIterator : unit -> FilteredElementIdIterator
Return Value
FilteredElementIdIterator
Exceptions
Exception | Condition
InvalidOperationException |  The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter.
Remarks
 Calling this when you have an active iterator to this same collector will result in the first iterator being stopped by this call.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace